# Konversi Tipe data String ke Numerik

In [1]:
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [3]:
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [4]:
df.dtypes

col1    object
col2    object
dtype: object

In [5]:
#Konversi tipe data dengan fungsi astype()
df_x=df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [6]:
df_x.dtypes

col1    object
col2     int32
dtype: object

In [7]:
#Konversi data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric,errors="coerce")
#coerce jika didapati data yang tidak bisa di konversi maka akan di ubah ke nan =not a number

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4